Чаты_единое_окно/src/Documents/УстановкаЦенКриптовалютныхАктивов/УстановкаЦенКриптовалютныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенКриптовалютныхАктивов</name>
  <registerRecords>InformationRegister.ЦеныКриптовалютныхАктивов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Криптовалюта</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Чаты_единое_окно/src/Documents/УстановкаЦенКриптовалютныхАктивов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвиженияПоЦенамКриптовалютныхАктивов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоЦенамКриптовалютныхАктивов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаЦенКриптовалютныхАктивов.Ссылка КАК Регистратор,
	|	УстановкаЦенКриптовалютныхАктивов.Дата КАК Период,
	|	УстановкаЦенКриптовалютныхАктивов.Криптовалюта КАК Криптовалюта,
	|	УстановкаЦенКриптовалютныхАктивов.Цена КАК Цена
	|ИЗ
	|	Документ.УстановкаЦенКриптовалютныхАктивов КАК УстановкаЦенКриптовалютныхАктивов
	|";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Движения.ЦеныКриптовалютныхАктивов.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ЦеныКриптовалютныхАктивов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
